In [3]:
import pandas as pd
import numpy as np

Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [4]:
q1 = {
    'X':[78,85,96,80,86],
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]
    }

q1 = pd.DataFrame(q1)
q1

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [5]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q2 = pd.DataFrame(exam_data, index=labels)
q2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [6]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q3 = pd.DataFrame(exam_data, index=labels)
q3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

Write a Pandas program to get the first 3 rows of a given DataFrame.

In [7]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q4 = pd.DataFrame(exam_data, index=labels)
q4.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [8]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q5 = pd.DataFrame(exam_data, index=labels)
q5[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Write a Pandas program to select the specified columns and rows from a given data frame.

In [9]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q6 = pd.DataFrame(exam_data, index=labels)
q6.loc[['b', 'd', 'f', 'g'], ['score', 'qualify']]
q6.iloc[[1,3,5,6], [1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [10]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q7 = pd.DataFrame(exam_data, index=labels)
q7[q7['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Write a Pandas program to count the number of rows and columns of a DataFrame.

In [11]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q8 = pd.DataFrame(exam_data, index=labels)
rows = len(q8.axes[0])
cols = len(q8.axes[1])
print(rows, cols)

10 4

Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [12]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q9 = pd.DataFrame(exam_data, index=labels)
q9[q9['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [13]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q10 = pd.DataFrame(exam_data, index=labels)
q10[(q10['score'] >= 15) & (q10['score'] <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [14]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q11 = pd.DataFrame(exam_data, index=labels)
q11[(q11['attempts'] < 2) & (q11['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Write a Pandas program to change the score in row 'd' to 11.5.

In [15]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q12 = pd.DataFrame(exam_data, index=labels)
q12.loc['d', 'score'] = 11.5
q12.loc['d', 'score']
q12

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to calculate the sum of the examination attempts by the students.

In [16]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q13 = pd.DataFrame(exam_data, index=labels)
q13['attempts'].sum()

19

Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [17]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q14 = pd.DataFrame(exam_data, index=labels)
q14['score'].mean()

13.5625

Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [18]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q15 = pd.DataFrame(exam_data, index=labels)
# q15.append({'name' : "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"}, ignore_index='k')
q15.loc['k'] = ['Suresh', 15.5, 1, 'yes']
q15.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [19]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q16 = pd.DataFrame(exam_data, index=labels)
q16.sort_values(by=['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [20]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q17 = pd.DataFrame(exam_data, index=labels)
q17['qualify'] = q17['qualify'].map({'yes': True, 'no': False})
q17

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [21]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q18 = pd.DataFrame(exam_data, index=labels)
q18.loc['d', 'name'] = 'Suresh'
q18

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [22]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q19 = pd.DataFrame(exam_data, index=labels)
q19.drop(columns='attempts', inplace=True)
q19

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

Write a Pandas program to insert a new column in existing DataFrame.

In [23]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q20 = pd.DataFrame(exam_data, index=labels)
q20['colour'] = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
q20

        name  score  attempts qualify  colour
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

Write a Pandas program to iterate over rows in a DataFrame.

In [24]:
exam_data = [
    {'name':'Anastasia', 'score':12.5}, 
    {'name':'Dima','score':9}, 
    {'name':'Katherine','score':16.5}
]

q21 = pd.DataFrame(exam_data)
for index, row in q21.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

Write a Pandas program to get list from DataFrame column headers.

In [25]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

q22 = pd.DataFrame(exam_data, index=labels)
list(q22.columns)

['name', 'score', 'attempts', 'qualify']

Write a Pandas program to rename columns of a given DataFrame.

In [26]:
my_dict = {
    'col1': [1, 2, 3],
    'col2': [4, 5, 6],
    'col3': [7, 8, 9]
}

q23 = pd.DataFrame(my_dict)
q23.columns = ['Column1', 'Column2', 'Column3']
# q23 = q23.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
q23

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [27]:
my_dict={
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q24=pd.DataFrame(my_dict)

q24[q24.loc[:, 'col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

Write a Pandas program to change the order of a DataFrame columns.

In [28]:
my_dict={
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q25=pd.DataFrame(my_dict)
q25.reindex(columns=['col3', 'col2', 'col1'])
# q25 = q25[['col3', 'col2', 'col1']]

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

Write a Pandas program to add one row in an existing DataFrame.

In [29]:
my_dict={
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q26=pd.DataFrame(my_dict)
# q25.append({'col1': 10, 'col2': 11, 'col3': 12}, ignore_index=True)
q26.loc[5] = [10, 11, 12]
q26

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [30]:
my_dict={
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q27=pd.DataFrame(my_dict)
q27.to_csv('w3_q27.csv', sep='\t', index=False)
q27_r = pd.read_csv('w3_q27.csv')
q27_r

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1

Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [31]:
my_dict={
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']
}

q28=pd.DataFrame(my_dict)
q28.groupby('city').size().reset_index(name='Number of People') # size() for counting rows. reset_index(name=) names new column

          city  Number of People
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Write a Pandas program to delete DataFrame row(s) based on given column value.\
Drop the row where col2 == 5

In [32]:
my_dict={
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q29=pd.DataFrame(my_dict)

# get names of indexes for which 
# cols has value 5
index_names = q29[q29['col2'] == 5].index

# drop these row indexes
# from dataFrame
q29.drop(index_names, inplace=True)
q29

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to widen output display to see more columns

In [33]:
my_dict={
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q30=pd.DataFrame(my_dict)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
q30

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to select a row of series/dataframe by given integer index.

In [34]:
my_dict = {
    'col1':[1,4,3,4,5],
    'col2':[4,5,6,7,8],
    'col3':[7,8,9,0,1]
    }

q31 = pd.DataFrame(my_dict)

q31.loc[[2]]

   col1  col2  col3
2     3     6     9

Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [35]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

q32 = pd.DataFrame(exam_data)

q32.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Write a Pandas program to convert index in a column of the given dataframe.

In [36]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

q33 = pd.DataFrame(exam_data)
q33.reset_index(inplace=True) # Generates a column of index values
q33.to_string(index=False) # Console friendly way to read it

' index      name  score  attempts qualify\n     0 Anastasia   12.5         1     yes\n     1      Dima    9.0         3      no\n     2 Katherine   16.5         2     yes\n     3     James    NaN         3      no\n     4     Emily    9.0         2      no\n     5   Michael   20.0         3     yes\n     6   Matthew   14.5         1     yes\n     7     Laura    NaN         1      no\n     8     Kevin    8.0         2      no\n     9     Jonas   19.0         1     yes'

Write a Pandas program to set a given value for particular cell in  DataFrame using index value.

In [37]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

q34 = pd.DataFrame(exam_data)

q34.loc[8, 'score'] = 10.2
q34

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes

Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [38]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

q35 = pd.DataFrame(exam_data)

# q35.isna().value_counts()
q35.isna().values.sum()

2

Write a Pandas program to drop a list of rows from a specified DataFrame.

In [39]:
d = {
        'col1': [1, 4, 3, 4, 5], 
        'col2': [4, 5, 6, 7, 8], 
        'col3': [7, 8, 9, 0, 1]
        }

q36 = pd.DataFrame(d)

q36.drop(index=[2, 4])

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

Write a Pandas program to reset index in a given DataFrame.

In [40]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

q37 = pd.DataFrame(exam_data)

q37.drop([0, 1], inplace=True)
q37.reset_index(inplace=True)
q37

   index       name  score  attempts qualify
0      2  Katherine   16.5         2     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

Write a Pandas program to divide a DataFrame in a given ratio.

In [41]:
df = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)
part_70 = df.sample(frac=0.7)
part_30 = df.drop(part_70.index)
print("\n70% of the said DataFrame:")
print(part_70)
print("\n30% of the said DataFrame:")
print(part_30)

Original DataFrame:
          0         1
0 -1.490219 -0.281839
1 -0.956206  0.853370
2  0.452287 -0.769605
3 -0.980478  1.129991
4  0.718874 -0.883651
5 -0.055084 -1.401789
6  1.645276 -0.492178
7  0.399402  0.022620
8  1.279677  0.949977
9 -0.833834 -0.296733

70% of the said DataFrame:
          0         1
1 -0.956206  0.853370
2  0.452287 -0.769605
7  0.399402  0.022620
5 -0.055084 -1.401789
0 -1.490219 -0.281839
4  0.718874 -0.883651
9 -0.833834 -0.296733

30% of the said DataFrame:
          0         1
3 -0.980478  1.129991
6  1.645276 -0.492178
8  1.279677  0.949977

Write a Pandas program to combining two series into a DataFrame.

In [42]:
q39a = pd.Series(['100', '200', 'python', '300.12', '400'])
q39b = pd.Series(['10', '20', 'php', '30.12', '40'])

q39 = pd.concat([q39a, q39b], axis=1) # axis=1 if you want to concat to a new column
q39

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

Write a Pandas program to shuffle a given DataFrame rows.

In [43]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

q40 = pd.DataFrame(exam_data)

q40.sample(frac=1) # frac=1 reshuffles entire dataset

        name  score  attempts qualify
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
1       Dima    9.0         3      no
5    Michael   20.0         3     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
0  Anastasia   12.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Write a Pandas program to convert DataFrame column type from string to datetime.

In [44]:
date = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print(date)
r = pd.to_datetime(pd.Series(date)) # changes it to datetime format
q41 = pd.DataFrame(r) # Creates a dataframe
print(q41)

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

Write a Pandas program to rename a specific column name in a given DataFrame.

In [45]:
d = {
    'col1': [1, 2, 3], 
    'col2': [4, 5, 6], 
    'col3': [7, 8, 9]
    }

q42 = pd.DataFrame(data=d)

q42.rename(columns={'col2': 'Column2'}, inplace=True)

Write a Pandas program to get a list of a specified column of a DataFrame.

In [46]:
d = {
    'col1': [1, 2, 3], 
    'col2': [4, 5, 6], 
    'col3': [7, 8, 9]
    }

q43 = pd.DataFrame(data=d)

list(q43['col1'])
q43['col1'].tolist()

[1, 2, 3]

Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

In [47]:
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values = np.zeros(15, dtype=dtype)
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df = pd.DataFrame(values, index=index)
print(df)

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

Write a Pandas program to find the row for where the value of a given column is maximum.

In [48]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }
q45 = pd.DataFrame(data=d)

q45.loc[:, 'col1'].argmax() # Finds the row index of the max value for that row

4

Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [49]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }
q46 = pd.DataFrame(data=d)

if 'col4' in df.columns:
    print('yes')
else:
    print('no')

no

Write a Pandas program to get the specified row value of a given DataFrame.

In [50]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }
q47 = pd.DataFrame(data=d)

q47.loc[0]
q47.loc[3]

col1    4
col2    9
col3    1
Name: 3, dtype: int64

Write a Pandas program to get the datatypes of columns of a DataFrame.

In [51]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

q48 = pd.DataFrame(exam_data)

q48.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

Write a Pandas program to append data to an empty DataFrame.

In [52]:
q49 = pd.DataFrame()
data = pd.DataFrame({
    "col1": range(3),
    "col2": range(3)
    })
# q49.append(data)
pd.concat([q49, data])

   col1  col2
0     0     0
1     1     1
2     2     2

Write a Pandas program to sort a given DataFrame by two or more columns.

In [53]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

q50 = pd.DataFrame(exam_data)

q50.sort_values(['attempts', 'name'], ascending=[True, True])

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

Write a Pandas program to convert the datatype of a given column (floats to ints).

In [54]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }

q51 = pd.DataFrame(exam_data)

q51['score'] = q51['score'].fillna(0)
q51['score'] = q51['score'].astype(int)
q51['score'].dtype

# q51['score'] = q51.convert_dtypes(convert_integer='score')
# q51['score'].dtypes

dtype('int32')

Write a Pandas program to remove infinite values from a given DataFrame.

In [55]:
q52 = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])

q52.replace([np.inf, -np.inf], np.nan, inplace=True)
q52

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

Write a Pandas program to insert a given column at a specific column index in a DataFrame.

In [56]:
d = {
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]}

q53 = pd.DataFrame(data=d)

q53.insert(loc=0, column='col1', value=[1, 2, 3, 4, 7])
q53

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Write a Pandas program to convert a given list of lists into a Dataframe.

In [57]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]

headers = my_lists.pop(0) # Removes first and sets headers as the first list

q54 = pd.DataFrame(my_lists, columns=headers)
q54

   col1  col2
0     2     4
1     1     3

Write a Pandas program to group by the first column and get second column as lists in rows.

In [58]:
q55 = pd.DataFrame({
    'col1':['C1','C1','C2','C2','C2','C3','C2'], 
    'col2':[1,2,3,3,4,6,5]
    })

q55.groupby('col1')['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Write a Pandas program to get column index from column name of a given DataFrame.

In [59]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }

q56 = pd.DataFrame(data=d)

q56.columns.get_loc('col2') # Finds the index of a given column

1

Write a Pandas program to count number of columns of a DataFrame.

In [60]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }

q57 = pd.DataFrame(data=d)

len(q57.columns)

3

Write a Pandas program to select all columns, except one given column in a DataFrame.

In [61]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }

q58 = pd.DataFrame(data=d)

q58.drop(columns='col3')

q58.loc[:, q58.columns != 'col3'] # Display all columns not equal to this

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

Write a Pandas program to get first n records of a DataFrame.

In [62]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }

q59 = pd.DataFrame(data=d)

q59.head(3)
q59[:3] # slice
q59.loc[:2] # loc

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

Write a Pandas program to get last n records of a DataFrame.

In [63]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5], 
    'col3': [7, 8, 12, 1, 11]
    }

q60 = pd.DataFrame(data=d)

q60[2:] # slice
q60.tail(3) # bottom of the data set

   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5    11

Write a Pandas program to get topmost n records within each group of a DataFrame.

In [66]:
d = {
    'col1': [1, 2, 3, 4, 7, 11], 
    'col2': [4, 5, 6, 9, 5, 0], 
    'col3': [7, 5, 8, 12, 1,11]
    }

q61 = pd.DataFrame(data=d)

q61.nlargest(3, 'col1') # Returning the top 3 rows where col1 is sorted by max to min
q61.nlargest(3, 'col2')

   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5

Write a Pandas program to remove first n rows of a given DataFrame.

In [70]:
d = {
    'col1': [1, 2, 3, 4, 7, 11], 
    'col2': [4, 5, 6, 9, 5, 0], 
    'col3': [7, 5, 8, 12, 1,11]
    }

q62 = pd.DataFrame(data=d)

q62.drop(list(q62[:3].index))
q62.iloc[3:]

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

Write a Pandas program to remove last n rows of a given DataFrame.

In [72]:
d = {
    'col1': [1, 2, 3, 4, 7, 11], 
    'col2': [4, 5, 6, 9, 5, 0], 
    'col3': [7, 5, 8, 12, 1,11]
    }

q63 = pd.DataFrame(data=d)

new_df = q63.iloc[:3]
new_df

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [76]:
q64 = pd.DataFrame({
    'W':[68,75,86,80,66],
    'X':[78,85,96,80,86], 
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]
    });

q64 = q64.add_prefix('A_')
q64 = q64.add_suffix('_1')
q64

   A_W_1  A_X_1  A_Y_1  A_Z_1
0     68     78     84     86
1     75     85     94     97
2     86     96     89     96
3     80     80     83     72
4     66     86     86     83

Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [83]:
q65 = pd.DataFrame({
    'W':[68,75,86,80,66],
    'X':[78,85,96,80,86], 
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]
    });

q65.iloc[:,::-1] # Reverse Columns
q65.iloc[::-1,:] # Reverse Rows

    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

Write a Pandas program to select columns by data type of a given DataFrame.

In [90]:
q66 = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

q66.dtypes
q66.select_dtypes(object), q66.select_dtypes(float)

(             name date_of_birth
 0  Alberto Franco    17/05/2002
 1    Gino Mcneill    16/02/1999
 2     Ryan Parkes    25/09/1998
 3    Eesha Hinton    11/05/2002
 4    Syed Wharton    15/09/1997,
     age
 0  18.5
 1  21.2
 2  22.5
 3  22.0
 4  23.0)

Write a Pandas program to split a given DataFrame into two random subsets.

In [97]:
q67 = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

a1 = q67.sample(frac=0.6)
a2 = q67.drop(a1.index)

Write a Pandas program to rename all columns with the same pattern of a given DataFrame.

In [102]:
q68 = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

q68.columns = q68.columns.str.lower().str.rstrip()
q68.head()

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

Write a Pandas program to merge datasets and check uniqueness.

In [107]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print('\n"one_to_one: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
print(df_one_to_one)
print('\n"one_to_many or 1:m: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
print(df_one_to_many)
print('many_to_one or m:1: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
print(df_many_to_one)

"one_to_one: check if merge keys are unique in both left and right datasets:"
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

"one_to_many or 1:m: check if merge keys are unique in left dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0
many_to_one or m:1: check if merge keys are unique in right dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

 Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.

In [111]:
q70 = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
    'age': [18, 22, 85, 50, 80, 5]
})
print("Original DataFrame:")
print(q70)
print('\nAge group:')
q70["age_groups"] = pd.cut(q70["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
print(q70["age_groups"])
print(q70)

Original DataFrame:
             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

Age group:
0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age_groups, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']
             name  age age_groups
0  Alberto Franco   18       kids
1    Gino Mcneill   22      adult
2     Ryan Parkes   85    elderly
3    Eesha Hinton   50      adult
4    Syed Wharton   80    elderly
5   Kierra Gentry    5       kids

Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.

In [112]:
q71 = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("\nGlobal usage of memory of the DataFrame:")
print(q71.info(memory_usage = "deep"))
print("\nThe usage of memory of every column of the said DataFrame:")
print(q71.memory_usage(deep = True))

Global usage of memory of the DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Date_Of_Birth   5 non-null      object
 2   Age             5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 849.0 bytes
None

The usage of memory of every column of the said DataFrame:
Index             128
Name              346
Date_Of_Birth     335
Age                40
dtype: int64

Write a Pandas program to combine many given series to create a DataFrame.

In [120]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])

# q72a = pd.DataFrame(sr1, sr2).reset_index()
q72b = pd.concat([sr1, sr2], axis=1) # axis=1 defines create a new column
q72b.rename(columns={0: 'col1', 1: 'col2'}, inplace=True)
q72b

     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [121]:
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:
                   A         B         C         D
hTMWbJ6hSu -1.504679  1.310588 -1.125020  0.314526
klMQstwKhv -1.410204 -0.030611 -0.033388  0.949356
Mu7U8uicTp -1.162123  1.349299  0.781028 -0.020037
sztJejcNPA -0.114987  0.376959  0.998334 -0.809962
S6LSnPeMgn  1.949909  1.080942 -0.207960 -1.317650
iPFTXO5Gpz -0.452424 -0.968810 -0.110113  1.441252
VBCTbW06fF  0.438798  1.837064  0.487524 -0.445945
rQvK6xsIXc -0.379303 -0.388458 -1.115355 -0.086791
wcouxQE6m9  2.143905  0.379693 -0.864453 -1.639264
EypuIWlApO  2.472642  0.596494 -0.412536 -0.880066
Y6lmpFyYjI -1.088877 -0.669841  0.568909  1.721928
B2e6PQ72Pj -0.678571  1.967930 -0.364686 -1.516747
2f0ue92CSW -0.124154  1.147256  0.267103 -0.197565
uVtKGO8SHj  0.210661 -0.110537 -0.025393 -1.756756
oLAWST5Bz6 -1.575586 -1.375490 -0.096495 -0.962666
QD81mgUnub -0.019370 -0.565889 -2.226247  0.498894
vX5TbUGHSW -0.013270 -0.369409  1.429574  0.321720
XoXt2vuEiz  1.226527  0.190052  1.451374  0.012813
Fu0vExdHMv -0.260669  1.149430  0.432062 -1.605044
DfzMm5otvX -0.742347  1.190640 -0.751284 -0.342637
t1luD78uH1  0.209461 -0.846572 -0.570676 -0.266644
O1OgndAZT4 -0.529802  1.170503 -1.133064  0.228241
OaDzHbi1zZ -0.261098 -0.845057  0.870870  0.275196
fCKrBTht6i -1.164933  0.025500  0.897769  1.056891
2yVGac2rJS -0.253478  1.219588  0.777522  0.234409
aD5BDvgmLK -1.620845  0.784564 -1.151680  0.687252
pZoiaeL7XX  0.799062 -0.365400 -0.063804 -0.585811
pBjlpaamzk  0.947448 -2.112580 -0.785994 -0.496584
gWxNyxxXUr -0.818742 -0.249795 -0.566217  0.472777
kwKPWfqgdf -0.450120  0.152977 -0.975866 -0.833980

DataFrame: Contains missing values:
                   A         B         C         D
xJ0qoWHKgG -1.458353 -1.129503  1.125766  1.667289
hCYgl0OOxe  0.706542 -0.896415       NaN  0.289771
kHJLSa0Tiw  0.174352  1.266105       NaN  0.230712
IfaCiOMJ5o  1.223239 -1.749093  0.894574  2.588447
m9otEgiNPF  0.444195  1.954375  0.971267       NaN
ICBdjiRsUH  0.507394 -0.225245 -0.779515 -0.300844
PjtT1wr1P0 -0.747596  0.290650  0.776849 -0.098709
GMXR4kPpR6  0.716756 -0.704364 -1.234608       NaN
sVESCSiQLL  1.187877  1.175146  0.106381 -0.042813
qubhQUT3az  0.626678 -0.348886  0.232062  1.088961
TlJjZ4JBY8  1.199901  1.208881 -2.411942 -1.097172
8V1xR2Hlyf  1.448320 -1.576997  0.455254 -1.436479
bzO4XeHaAp  0.861765  0.278641  1.448052 -2.588336
JBSMb4sPOu -0.455954 -0.371609 -1.725637 -0.322031
KCTRUnXiV3 -0.126945 -2.244527  1.176565 -1.216886
3VEOZtfRy2  0.156081  0.355249  0.100416  0.449694
t7nno3WCEq       NaN -0.374377 -1.779296 -1.484529
thQf0tKZnk -1.715674  0.197974  0.000217  1.067833
KyRZY3H0HQ -2.970806  0.123834 -1.342277       NaN
Ndpny0JpBc  1.577638       NaN -1.024946 -1.321401
4T4oERWuVr  0.757763 -0.962716       NaN -0.506816
xPmeMxVznn -1.370165 -0.764155 -0.702162 -1.263268
6F25WuAZhk -1.392107       NaN -0.033126  1.186272
XaGymqMa1o -0.241130 -1.151349  0.991662 -0.032713
MeXF5uL71w -0.618720       NaN -1.133356 -0.333571
TRFhMbOqeI  1.038981  2.230534  1.262327  0.716924
X5n1dhfofd -1.817579  1.553558  0.513797  0.111866
y0ynAZYgIt  1.367010       NaN  1.506679 -0.570092
FxjMlrqZca  0.440288       NaN  3.151981  0.377477
ZzMRj4XcGd -1.241803  1.042961 -0.524909 -0.229131

DataFrame: Contains datetime values:
                   A         B         C         D
2000-01-03 -0.467431 -0.905061  0.270050  0.333755
2000-01-04 -1.240296  0.494852 -0.547510  0.545244
2000-01-05  0.679855 -0.031266 -1.757530  0.142863
2000-01-06  1.048038  0.800301 -1.292305 -0.197772
2000-01-07 -1.714801  0.281912 -1.010439  0.694722
2000-01-10  0.985882 -0.585028 -0.196907  2.249420
2000-01-11  0.552471 -0.245515  0.559182 -0.810827
2000-01-12  0.013859  1.607726  1.047531  0.934747
2000-01-13  1.725184  0.380445  0.338529 -0.326878
2000-01-14  0.598757  0.402118  0.045578 -0.344491
2000-01-17 -1.023718 -0.635883  2.007941 -0.005743
2000-01-18 -0.469074  1.304879  1.135330  0.211303
2000-01-19  0.325536  0.029906  1.222132 -0.525228
2000-01-20 -0.082630 -0.844510 -0.138007  0.874283
2000-01-21  0.725491 -1.337073  0.375385 -0.307237
2000-01-24  2.083510 -0.988541  0.673689 -1.605513
2000-01-25  0.210052 -0.283851  0.415952  1.370966
2000-01-26 -0.196730  0.730880 -1.699457  1.334118
2000-01-27 -0.084203 -1.014430  2.067208 -0.174574
2000-01-28 -0.383950  0.068240 -1.239580  1.200828
2000-01-31  0.320706 -0.324234  0.853742  0.963004
2000-02-01 -0.656568  0.166649 -0.153254  1.135394
2000-02-02  1.210318 -0.471180  0.094741  1.023914
2000-02-03 -1.256779 -0.493220  0.637031  0.477104
2000-02-04 -0.112066  1.535223  0.034543 -0.223255
2000-02-07 -0.537112  1.362482  0.367574 -0.063720
2000-02-08  2.858092  0.104715 -1.530579  0.667056
2000-02-09 -0.034454 -1.696254  1.588806 -0.249466
2000-02-10  1.145447  0.227473  0.543726 -0.455538
2000-02-11  0.365500  1.391291  1.731190 -0.289303

DataFrame: Contains mixed values:
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

d:\faizm\Documents\SpartaGlobal\Data204Notes\DataWithPython\venv\Lib\site-packages\pandas\util\__init__.py:16: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

Write a Pandas program to fill missing values in time series data.\
From Wikipedia , in the mathematical field of numerical analysis, interpolation is a type of estimation, a method of constructing new data points within the range of a discrete set of known data points.

In [122]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df.index = pd.util.testing.makeDateIndex()[0:6]
print("Original DataFrame:")
print(df)
print("\nDataFrame after interpolate:")
print(df.interpolate())

Original DataFrame:
               c1    c2
2000-01-03  120.0   7.0
2000-01-04  130.0   NaN
2000-01-05  140.0  10.0
2000-01-06  150.0   NaN
2000-01-07    NaN   5.5
2000-01-10  170.0  16.5

DataFrame after interpolate:
               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

Write a Pandas program to use a local variable within a query.

In [129]:
q75 = pd.DataFrame({
    'W':[68,75,86,80,66],
    'X':[78,85,96,80,86], 
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]
    });


maxx = q75['W'].max()
q75.query('W < @maxx') # Values which are less than maximum value of 'W' column

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [137]:
d = {
    "agent": ["a001", "a002", "a003", "a003", "a004"], 
    "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]
    }

q76 = pd.DataFrame(d)

print("Original dataframe:")
print(q76)

print("\nData Types:")
print(q76["purchase"].apply(type))
q76["purchase"] = q76["purchase"].replace("[$]", "", regex = True).astype("float")

print("\nNew Data Types:")
print(q76["purchase"].apply(type))

Original dataframe:
  agent  purchase
0  a001    4500.0
1  a002    7500.0
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Data Types:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a dataframe.

In [138]:
q77 = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame:")
print(q77)
label1, unique1 = pd.factorize(q77['Name'])
print("\nNumeric representation of an array by identifying distinct values:")
print(label1)
print(unique1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

Numeric representation of an array by identifying distinct values:
[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [139]:
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})
print("Original DataFrame:")
print(df1)
df1['rnum']=df1.rnum.where(df1.rnum.eq(df1.rnum.cummax()),0)
print("\nReplace current value in a dataframe column based on last largest value:")
print(df1)

Original DataFrame:
    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19

Replace current value in a dataframe column based on last largest value:
    rnum
0     23
1      0
2     27
3      0
4     34
5      0
6     34
7      0
8      0
9      0
10    34
11     0
12     0
13     0
14     0

Write a Pandas program to create a DataFrame from the clipboard (data from an Excel spreadsheet or a Google Sheet).

In [141]:
df = pd.read_clipboard() # creates a dataframe from what you have 'right click copy'
print("Data from clipboard to DataFrame:")
print(df)

Data from clipboard to DataFrame:
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to check for inequality of two given DataFrames.

In [142]:
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrames:")
print(df1)
print(df2)
print("\nCheck for inequality of the said dataframes:")
print(df1.ne(df2))

Original DataFrames:
      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  85.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  83  72
4   NaN  86.0  86  83
      W   X   Y   Z
0  78.0  78  84  86
1  75.0  85  84  97
2  86.0  96  89  96
3  80.0  80  83  72
4   NaN  76  86  83

Check for inequality of the said dataframes:
       W      X      Y      Z
0   True  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False  False
4   True   True  False  False

Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [143]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nLowest n records within each group of a DataFrame:")
df1 = df.nsmallest(3, 'col1')
print(df1)
df2 = df.nsmallest(3, 'col2')
print(df2)
df3 = df.nsmallest(3, 'col3')
print(df3)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

Lowest n records within each group of a DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5
   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7